aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/userdefine.h
/* 
 * File:   userdefine.h
 * Author: ICE_MEGANE
 *
 * Created on 2026/03/04, 22:26
 */

#ifndef USERDEFINE_H
#define	USERDEFINE_H

#ifdef	__cplusplus
extern "C" {
#endif

#include "./mcufunc/pic18f25q10.h"

/* 未使用関数設定 */
#define UNUSED_FUNCTION_HIDE_SETTING        OFF


/* 共通マクロ設定 */
#define     CLEAR   0U
#define     OFF     0U
#define     LOW     0U
#define     DOWN    0U
#define     BACKWARD 0U

#define     SET     1U
#define     ON      1U
#define     HI      1U
#define     UP      1U
#define     FORWARD 1U

#define     MID     3U

/* 共通型名称 */
typedef  unsigned char   u8;
typedef  unsigned short  u16;
typedef  unsigned long   u32;

typedef  signed char    s8;
typedef  signed short   s16;
typedef  signed long    s32;

#define     U8_MAX     ((u8)0xFF)
#define     U16_MAX    ((u16)0xFFFF)
#define     U32_MAX    ((u32)0xFFFFFFFF)


/* 全ファイル共通変数 */
extern u16 u16_ud_debug_output0;
extern u16 u16_ud_debug_output1;
extern u16 u16_ud_debug_output2;
extern u16 u16_ud_debug_output3;

/* 全ファイル共通関数 */
extern void func_ud_g_init( void );
extern u32 func_ud_g_calcmul_2x2_byte( u16 u16_arg1, u16 u16_arg2 );
extern u32 func_ud_g_calcdiv_4x4_byte( u32 u32_arg1, u32 u32_arg2 );

#ifdef	__cplusplus
}
#endif

#endif	/* USERDEFINE_H */
